{"name": "Pooria Taghdiri", "phone": null, "location": "Montreal, Canada", "email": null, "github": "GitHub/PooriaT", "linkedin": "in/pooriataghdiri", "summary": "Results-driven software developer with 5+ years in web development, specializing in Python. Proven in designing and implementing solutions, collaborating with cross-functional teams, and using technologies like Django, Flask, and ReactJS. Skilled in agile methodologies, code reviews, and CI/CD pipelines for project success. Strong in REST API development and database integration, dedicated to delivering high-quality code and exceptional user experiences.", "skills": {"languages": "Python, C++, Bash, PHP, Java, Golang", "backend_development": "Django, Flask", "frontend_development": "HTML, CSS, JavaScript, TypeScript, ReactJS", "databases": "Relational Database (MySQL), NoSQL Database (MongoDB)", "deployment_infrastructure": "Git, GitFlow, Docker, AWS (EC2, S3), Azure, CI/CD pipelines (GitHub Actions)", "methodologies": "Agile methodologies including Scrum, project management tools like Jira, Confluence", "other": "Proficient in writing and implementing unit tests, integration tests, OOP, Software Architecture, REST API, GraphQL, gRPC, Linux/Unix"}, "education": [{"degree": "M.Eng", "field": "Electrical and Computer Engineering", "university": "Concordia University, Canada", "gpa": "3.9/4.3", "dates": "2022 - 2023"}, {"degree": "B.Sc", "field": "Electrical Engineering (Electronics)", "university": "Zanjan University, Iran", "gpa": "17.54/20", "dates": "2007 - 2011"}], "work_experience": [{"title": "Software Developer", "company": "Grey-Box", "location": "Montreal, Canada", "dates": "Sep 2023 - Present", "description": "Collaborating with cross-functional teams to design and implement software solutions. Creating a bot for Messaging platforms, including Telegram, to interact with REST API. Actively participating in code reviews, debugging, and collaborative planning to drive team goals. Utilizing JavaScript and the ReactJs framework for front-end development. Developing code, design documents, and unit/integration tests to enhance the capabilities of the platform.", "skills": "Python, Django, Flask, Rest API, JavaScript, React, Java, MongoDB"}, {"title": "Web Developer", "company": "MTN Group", "location": null, "dates": "Jun 2015 – Dec 2021", "description": "Developed Python web applications using Django and Flask frameworks, integrated with Relational databases (SQLite). Utilized Native JavaScript and Bootstrap for front-end development, enhancing user interface design and interactivity. Enhanced task efficiency by leveraging Linux bash scripting to automate daily processes. Successfully completed 8 complex projects on time, focusing on swift issue resolution and stakeholder satisfaction.", "skills": "Python, Django, Flask, Rest API, SQLite, JavaScript"}, {"title": "Python Back-end Developer", "company": "Skylla Connect", "location": null, "dates": "Oct 2020 – Feb 2021", "description": "Established a software training platform for over 500 youth in Africa. Reduced back-end development cycle with Python-based Django framework. Collaboratively enhanced the React.js front-end, improving UI responsiveness. Efficiently managed services and databases using Google Firebase, resulting in optimized data retrieval.", "skills": "Python, Google Firebase, JavaScript, React.js"}]}